ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_sec_mgr_regs.xml
<module id="HSM_SEC_MGR" HW_revision="" description="HSM SEC MGR Registers">
	<register id="SEC_MGR_ID" width="32" page="0" offset="0" internal="0" description="Peripheral ID register">
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
		<bitfield id="BU" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="FUNC" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="RTL_VER" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="MAJOR_REV" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MINOR_REV" description="" begin="5" end="0" width="6" rwaccess="R"/>
	</register>
	<register id="SYS_STATUS" width="32" page="0" offset="256" internal="0" description="System Status register">
		<bitfield id="HS_SUBTYPE" description="" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="DEVICE_TYPE" description="" begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="RESET_STATUS" width="32" page="0" offset="528" internal="0" description="Reset Status register">
		<bitfield id="CUST_EFUSE_RST" description="" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="POR" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="WRITE_ONCE_ONLY_STATUS" width="32" page="0" offset="768" internal="0" description="Write-once only status register">
		<bitfield id="MSV_ACCESS_CONTROL_LOCKED" description="" begin="31" end="31" width="1" rwaccess="R"/>
		<bitfield id="SWRV_ACCESS_CONTROL_LOCKED" description="" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="BMEK_ACCESS_CONTROL_LOCKED" description="" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="BMPK_PT2_ACCESS_CONTROL_LOCKED" description="" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="BMPK_PT1_ACCESS_CONTROL_LOCKED" description="" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="SMEK_ACCESS_CONTROL_LOCKED" description="" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="SMPK_PT2_ACCESS_CONTROL_LOCKED" description="" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="SMPK_PT1_ACCESS_CONTROL_LOCKED" description="" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="KEK_ACCESS_CONTROL_LOCKED" description="" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="TIMEK_ACCESS_CONTROL_LOCKED" description="" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="TIMPK_PT2_ACCESS_CONTROL_LOCKED" description="" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="TIMPK_PT1_ACCESS_CONTROL_LOCKED" description="" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SEC_TRACE_ENABLE" description="" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SEC_DEBUG_ENABLE" description="" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SEC_EMU_ENABLE" description="" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="DMSC_DBGEN" description="" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SEC_OVERRIDE" description="" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SEC_ROM_ACCESS" description="" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="FW_BYPASS_ACCESS_REG" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="NONMASK_ROM_ACCESS_REG" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SEC_TEST_EN" description="" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="BSC_ENABLE" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CATSCAN_ENABLE" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DMLED_CORE" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SEC_EFUSE_RD_DISABLE" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SEC_EFUSE_WR_DISABLE" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="EFUSE_JTAG_DISABLE_STATUS" width="32" page="0" offset="1280" internal="0" description="Efuse JTAG Disable Status register">
		<bitfield id="JTAG_DISABLE" description="" begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="SMPK_PART1_STATUS_REG" width="32" page="0" offset="2048" instances="8" instaddr="4" internal="0" description="SMPK-Part1 Reg Status Register">
		<bitfield id="SMPK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SMPK_PART2_STATUS_REG" width="32" page="0" offset="2128" instances="8" instaddr="4" internal="0" description="SMPK-Part2 Status Register">
		<bitfield id="SMPK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SMEK_ID_STATUS_REG" width="32" page="0" offset="2176" internal="0" description="SMEK ID Status Register">
		<bitfield id="SMEK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BMPK_PART1_STATUS_REG" width="32" page="0" offset="2304" instances="8" instaddr="4" internal="0" description="BMPK-Part1 Status Register">
		<bitfield id="BMPK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BMPK_PART2_STATUS_REG" width="32" page="0" offset="2384" instances="8" instaddr="4" internal="0" description="BMPK-Part2 Reg Status Register">
		<bitfield id="BMPK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BMEK_ID_STATUS_REG" width="32" page="0" offset="2432" internal="0" description="BMEK ID Status Register">
		<bitfield id="BMEK" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SWRV_STATUS_REG" width="32" page="0" offset="3328" instances="8" instaddr="4" internal="0" description="SWRV Status Register">
		<bitfield id="SWRV" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MSV_STATUS_REG" width="32" page="0" offset="3408" internal="0" description="MSV Reg Status Register">
		<bitfield id="MSV" description="" begin="23" end="0" width="24" rwaccess="R"/>
	</register>
	<register id="FIREWALL_BYPASS_CONTROL" width="32" page="0" offset="4096" internal="0" description="Firewall Bypass Control Register">
		<bitfield id="LOCK_REGISTER" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="DMSC_FIREWALL_BYPASS" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="SOC_FIREWALL_BYPASS" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="SRAM_ERASE" width="32" page="0" offset="4432" internal="0" description="SRAM Erase and ROM Access Control Register">
		<bitfield id="DMSC_ERASE_ASSERT_CYCLES" description="" begin="31" end="24" width="8" rwaccess="RW"/>
		<bitfield id="ERASE_DMSC_SRAMS" description="" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="DMSC_DEBUG_CNTL" width="32" page="0" offset="4608" internal="0" description="DMSC Debug Control Register">
		<bitfield id="DMSC_DBGEN_ENABLE" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="SOC_SEC_DBG_CNTL" width="32" page="0" offset="4624" internal="0" description="SoC Secure Debug/Emulation Control Register">
		<bitfield id="SEC_DBG_ENABLE" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_DOM" width="32" page="0" offset="4640" internal="0" description="DebugSS DOM control register">
		<bitfield id="DEBUGSS_SEC_CTL_DOM" description="" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_CNTL" width="32" page="0" offset="4656" internal="0" description="DebugSS Control Register">
		<bitfield id="DEBUGSS_AUX_FT3" description="" begin="31" end="28" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_AUX_FT2" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_AUX_FT1" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_AUX_FT0" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_SEC_VBUSM_FW_EN" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_SEC_AXIAP_FW_EN" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_APBAP_FW_EN" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="DEBUGSS_JTAGAP_FW_EN" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_DBG_TAP_FW_EN" width="32" page="0" offset="4660" internal="0" description="DebugSS Debug Tap Firewall Enable Register">
		<bitfield id="DEBUGSS_DBG_TAP_FW_EN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="FAULT_TOLERANT_EFUSE_OPTS" width="32" page="0" offset="5376" internal="0" description="Fault Tolerant ROM Defined Device Config Efuse Register">
		<bitfield id="OPT0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OPT1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="SEC_RAM_ACCESS_CNTL" width="32" page="0" offset="5888" internal="0" description="External Secure RAM Access Control Register">
		<bitfield id="LOCK_REGISTER" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="WRITE_ACCESS" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="READ_ACCESS" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="SEC_RAM_INDEX_CNTL" width="32" page="0" offset="5892" internal="0" description="External Secure RAM Selection Control Register">
		<bitfield id="LOCK_REGISTER" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="INDEX" description="" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SEC_RAM_MUXSEL_CNTL" width="32" page="0" offset="5896" internal="0" description="External Secure RAM Selection Control Register">
		<bitfield id="LOCK_REGISTER" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="MUX_SEL" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="KEK_ACCESS_CNTL" width="32" page="0" offset="7168" internal="0" description="KEK Access Control Register">
	</register>
	<register id="SW_KEK_DATA_REG" width="32" page="0" offset="7184" instances="8" instaddr="4" internal="0" description="SW KEK Data Register">
	</register>
	<register id="CUST_KEY_COUNT" width="32" page="0" offset="8192" internal="0" description="Customer Key Count Register">
		<bitfield id="CUST_KEY_COUNT" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CUST_KEY_REV" width="32" page="0" offset="8208" internal="0" description="Customer Key Revision Register">
		<bitfield id="CUST_KEY_REVISION" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CUST_CODE_PROV" width="32" page="0" offset="8224" internal="0" description="Customer Code Provisioned Register">
		<bitfield id="CODE_PROVISIONED" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CUST_FAILURE_ANALYSIS_EN" width="32" page="0" offset="8240" internal="0" description="Customer Failure Analysis Enabled Register">
		<bitfield id="EN" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CUST_DECOMMISSION_EN" width="32" page="0" offset="8256" internal="0" description="Decommission Enabled Register">
		<bitfield id="EN" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="CUST_MISC_DATA" width="32" page="0" offset="8448" internal="0" description="Cust Misc Data Access Register">
	</register>
	<register id="CUST_MISC_DATA_REG" width="32" page="0" offset="8464" instances="8" instaddr="4" internal="0" description="Cust Misc Data Reg Register">
		<bitfield id="CUST_MISC" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMPK_PT1_ACCESS_CNTL" width="32" page="0" offset="8704" internal="0" description="SMPK-Part1 Access Control Register">
	</register>
	<register id="SMPK_PT1_DATA_REG" width="32" page="0" offset="8720" instances="8" instaddr="4" internal="0" description="SMPK-Part1 Data Register">
		<bitfield id="SMPK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMPK_PT1_BCH" width="32" page="0" offset="8784" internal="0" description="SMPK-Part1 BCH Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMPK_PT2_ACCESS_CNTL" width="32" page="0" offset="8960" internal="0" description="SMPK-Part2 Access Control Register">
	</register>
	<register id="SMPK_PT2_DATA_REG" width="32" page="0" offset="8976" instances="8" instaddr="4" internal="0" description="SMPK-Part2 Data Register">
		<bitfield id="SMPK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMPK_PT2_BCH" width="32" page="0" offset="9040" internal="0" description="SMPK-Part2 BCH Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMEK_ACCESS_CNTL" width="32" page="0" offset="9216" internal="0" description="SMEK Access CNTL Register">
	</register>
	<register id="SMEK_ID" width="32" page="0" offset="9220" internal="0" description="SMEK ID Data Register">
		<bitfield id="SMEK_ID" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMEK_DATA_REG" width="32" page="0" offset="9232" instances="8" instaddr="4" internal="0" description="SMEK Data Register">
		<bitfield id="SMEK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SMEK_BCH" width="32" page="0" offset="9296" internal="0" description="SMEK-BCH Key Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SKEY_OPTS_PT1" width="32" page="0" offset="9344" internal="0" description="Customer SKey Options Part1">
		<bitfield id="OPT0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OPT1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="OPT2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="OPT3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="OPT4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="OPT5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="OPT6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="OPT7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SKEY_OPTS_PT2" width="32" page="0" offset="9348" internal="0" description="Customer SKey Options Part2">
		<bitfield id="OPT0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OPT1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="OPT2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="OPT3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="OPT4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="OPT5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="OPT6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="OPT7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="BMPK_PT1_ACCESS_CNTL" width="32" page="0" offset="9472" internal="0" description="BMPK-Part1 Access Control Register">
	</register>
	<register id="BMPK_PT1_DATA_REG" width="32" page="0" offset="9488" instances="8" instaddr="4" internal="0" description="BMPK-Part1 Data Register">
		<bitfield id="BMPK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMPK_PT1_BCH" width="32" page="0" offset="9552" internal="0" description="BMPK-Part1 BCH Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMPK_PT2_ACCESS_CNTL" width="32" page="0" offset="9728" internal="0" description="BMPK-Part2 Access Control Register">
	</register>
	<register id="BMPK_PT2_DATA_REG" width="32" page="0" offset="9744" instances="8" instaddr="4" internal="0" description="BMPK-Part2 Data Register">
		<bitfield id="BMPK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMPK_PT2_BCH" width="32" page="0" offset="9808" internal="0" description="BMPK-Part2 BCH Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMEK_ACCESS_CNTL" width="32" page="0" offset="9984" internal="0" description="BMEK Access CNTL Register">
	</register>
	<register id="BMEK_ID" width="32" page="0" offset="9988" internal="0" description="BMEK ID Data Register">
		<bitfield id="BMEK_ID" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMEK_DATA_REG" width="32" page="0" offset="10000" instances="8" instaddr="4" internal="0" description="BMEK Data Register">
		<bitfield id="BMEK" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BMEK_BCH" width="32" page="0" offset="10064" internal="0" description="BMEK BCH Register">
		<bitfield id="BCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BKEY_OPTS_PT1" width="32" page="0" offset="10112" internal="0" description="Customer BKey Options Part1">
		<bitfield id="OPT0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OPT1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="OPT2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="OPT3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="OPT4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="OPT5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="OPT6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="OPT7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="BKEY_OPTS_PT2" width="32" page="0" offset="10116" internal="0" description="Customer BKey Options Part2">
		<bitfield id="OPT0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OPT1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="OPT2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="OPT3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="OPT4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="OPT5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="OPT6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="OPT7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SWRV_ACCESS_CNTL" width="32" page="0" offset="11008" internal="0" description="SWRV Access Control Register">
	</register>
	<register id="SWRV_DATA_REG" width="32" page="0" offset="11024" instances="8" instaddr="4" internal="0" description="SWRV Data Register">
		<bitfield id="SWRV" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MSV_ACCESS_CNTL" width="32" page="0" offset="11088" internal="0" description="MSV Access Control Register">
	</register>
	<register id="MSV_DATA_REG" width="32" page="0" offset="11104" internal="0" description="MSV Data Register">
		<bitfield id="BCH" description="" begin="31" end="24" width="8" rwaccess="RW"/>
		<bitfield id="MSV" description="" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="FLASH_WEPROT_REG" width="32" page="0" offset="11264" instances="4" instaddr="4" internal="0" description="Flash Wrtie Erase Protection Register">
		<bitfield id="WEPROT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="OTP_VAL_REG" width="32" page="0" offset="12288" instances="52" instaddr="4" internal="0" description="Customer OTP Viewer Register">
		<bitfield id="OTP_DATA" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
